<?php require_once __DIR__ . './bootstrap/autoload.php';
?>
<div class="col-md-12 p-5 mt_gray_bgc">
    <div class="container">
        <div class="mt_single_course_title mb-4">
            <h1 class="text-secondary">مدیریت پروژه های متن‌باز با git و github</h1>
        </div>
        <div class="row">
            <div class="col-lg-8 p-0">
                <div class="col-md-12 mt_single_course">

                    <img src="public/images/13980623000670_Test_PhotoN.jpg" class="img-responsive" style="width: 100%">
                    <br><br>
                    <div class="p-3 mt_white_bgc mt_course_description mt_border my-4">
                        <p >
                            در طی ۶ ماه گذشته، من زمان قابل‌توجهی برای یادگیری برنامه‌نویسی با زبان‌های مختلف صرف کردم.
                            من مطالب
                            بسیاری در ارتباط با روند کدنویسی حرفه‌ایی و تبدیل‌شدن به یک برنامه‌نویس خوب را یاد گرفتم.
                            ممکن است
                            بعضی
                            از آموخته‌های من برای شما هم در این مسیر مفید باشد. پس با من در این مقاله همراه باشید.

                            من متوجه شدم که مردم برای علاقه‌مند شدن به چیزهای قطعی به دنیا نیامده‌اند. این یک خیال است و
                            تا حد
                            زیادی
                            بستگی به چشم‌انداز شما از هدفتان، در حال حاضر دارد. هیچ‌چیزی در کلاس علم کامپیوتر در زمان
                            دبیرستان
                            مرا
                            جذب نمی‌کرد و به‌اجبار در آن شرکت می‌کردم؛ اما الان که خودم دنبال آن رفتم، همه‌چیز کاملاً
                            فرق
                            می‌کند.

                            من شروع کردم به کشف اینکه به‌تنهایی با روش‌ها و گام‌های خودم چه‌کارهایی می‌توانم با
                            برنامه‌نویسی
                            انجام
                            دهم. این موضوع به‌طور کامل چشم‌انداز مرا تغییر داد. یادگرفتن کدنویسی با هر روشی که خودم دوست
                            داشتم،
                            بدون
                            محدودیت زمانی و وجود یک معلم که مدام بگوید چه‌کاری انجام دهید، طرز فکر مرا تغییر داد. الان
                            پتانسیل
                            برنامه‌نویسی بالایی در خودم می‌بینم و از آن لذت می‌برم.

                            احتمالاً در زمان دبیرستان تدریس معلم برای من جالب نبوده و یا اینکه از نظر ذهنی آماده یادگیری
                            برنامه‌نویسی نبودم. به‌هرحال دلیل آن هرچه که بوده، این سخن کوتاه شخصی است که به شما در فهم
                            بهتر گام
                            اول
                            کمک می‌کند:
                            اگر شما فکر می‌کنید که نمی‌توانید کدنویسی کنید، بهتر است سعی کنید طرز فکر خود را تغییر دهید

                            مطالبی که من در طی 6 ماه آموزش کدنویسی آموختم

                            تقریباً ۴ ماه پیش، من در دوره آموزشی راکت شرکت کردم. من عاشق قسمت HTML و CSS شدم چون
                            می‌توانستم
                            بفهمم که
                            کد من در لحظه چه‌کاری انجام می‌دهد. فعل و انفعالی و بصری بودن آن، برای من عالی بود و در آن
                            بخش تحت
                            تأثیر
                            قرار گرفتم.

                            اگرچه زمانی‌که به بخش جاوااسکریپت رسیدیم، آن‌قدر تحت تأثیر قرار نگرفتم؛ اما بخش Syntax
                            جاوااسکریپت
                            را به
                            اتمام رساندم، چون می‌دانستم که به آن نیاز دارم و درنهایت توانستم از پس تکالیف آن بربیایم.

                            من از این بخش وحشت داشتم چون مرا به یاد کلاس دبیرستانم می‌انداخت. به‌جای از دست دادن
                            انگیزه‌ام، راکت
                            را
                            نگه‌داشتم و به سمت سایر منابع رفتم. با الهام گرفتن از بین برنامه‌های ساده مثل Tic-Tac-Toe و
                            Tetris
                            توانستم اولین برنامه خودم را بنویسم . با استفاده از این روش روی syntax جاوااسکریپت مهارت
                            پیدا کردم.
                            بیشتر آموزش‌ها در حال حاضر از ES۶ syntax و بعضی از روش‌های معمول استفاده می‌کنند؛ بنابراین
                            آن‌ها را
                            هم
                            تمرین کردم.

                            من با این روش که خودم شروع به یادگیری برنامه‌نویسی کردم، کاملاً چشم‌اندازم را تغییر دادم.
                            دفعه دوم
                            تغییرات بیشتری اعمال کردم، از آموزش‌های متن‌باز (open source) به سمت آموزش‌های کلاسی رفتم.
                            گاهی تمام
                            چیزی که شما برای ادامه دادن نیاز دارید، اِعمال تغییرات کوچک است.

                            درمورد آموزش‌ها صحبت کردیم، اگرچه...
                        </p>
                    </div>

                </div>
            </div>
            <div class="col-lg-4 p-0 mt_sidebar">
                <div class="card mt_single_sidebar">
                    <div class="card-body text-center mt_course_price p-4">
                        <h3 class="text-success">قیمت : 1200000</h3>
                        <br>
                        <a href="" class="btn btn-success btn-block btn-lg mt_buy_course"> ثبت نام در دوره</a>
                    </div>
                </div>
                <div class="card mt_single_sidebar">
                    <div class="card-body">
                        <ul>
                            <li><span class="fa fa-user"></span>ظرفیت باقی مانده : 10</li>
                            <li><span class="fa fa-clock-o"></span>زمان برگزاری : 10</li>
                            <li><span class="fa fa-user-circle"></span>مدرس : محمد طهوریان</li>
                            <li><span class="fa fa-bullhorn"></span>وضعیت :  در حال برگذاری</li>
                        </ul>
                    </div>
                </div>
            </div>
        </div>

    </div>
</div>


<?php viewRender('Home/layout.php', 'مدیریت پروژه های متن‌باز با git و github'); ?>
