<?php namespace App\Controllers;

class NewsController extends Controller {

  public function index()
  {
      return [
          'title' => 'فرار مالیاتی پزشکان و وکلا معادل نیمی از یارانه نقدیر ',
          'image' => 'images/13980623000670_Test_PhotoN.jpg',
          'body'  => '  به طور کلی، درآمدهای مالیاتی چند دسته است که شامل مالیات از اشخاص حقوقی (شامل شرکت‌ها، بنیادها و نهادها)، مالیات بر درآمد(کارکنان دولتی و خصوصی، اصناف) و سایر مالیات ها تقسیم می‌شود. درآمدهای مالیاتی شامل مالیات و گمرک در قانون بودجه 98، 172 هزار میلیارد تومان است که 32 هزار میلیارد تومان آن متعلق به گمرک است و مابقی (140 هزار میلیارد تومان) خالص درآمدهای مالیاتی است. از این 140 هزار میلیارد تومان نیز 13 هزار میلیارد تومان آن مربوط به مالیات گروه حقوق و دستمزدی‌ها و 10 هزار میلیارد تومان مربوط به مالیات گروه مشاغل است.

            مقایسه اعداد و ارقام ذکر شده نشان میدهد؛ گروه مشاغل که شامل پزشکان، وکلا، طلافروشان، آهن‌فروشان، رستوران‌ها، هتل‌ها و .... می‌شود و درآمد بسیار بالایی نیز دارند مالیات بسیار کمی پرداخت می‌کنند. به طوریکه مجموع مالیات پرداختی آنها حتی از مالیات کارمندان دولت که ذیل دسته حقوق و دستمزدی‌ها قرار میگیرند نیز کمتر است.

            طبق گزارش مرکز آمار، سهم گروه مشاغل از کل تولید ناخالص (مجموع گردش مالی در اقتصاد ایران) حدود 36 درصد است. در نتیجه سهم مالیاتی این گروه نیز از کل مالیات باید حدود 36 درصد باشد. اما طبق قانون بودجه 98 تنها 7 درصد از کل مالیات (10 هزار میلیارد تومان) از گروه مشاغل اخذ می‌شود. در نتیجه اگر با یک جدول تناسب مقدار 8 درصد را به 36 درصد رسانده شود مقدار واقعی فرار مالیاتی گروه مشاغل مشخص می‌شود. این مقدار حدود 40 هزار میلیارد تومان است.

            رقم 40 هزار میلیارد تومانی فرار مالیاتی گروه مشاغل در صورتی محاسبه شده که سهم این گروه از کل تولید ناخالص ملی 36 درصد باشد نه بیشتر زیرا بسیاری از گردش مالی در حوزه مشاغل نیز شفاف نبوده و به اصطلاح اقتصاد زیرزمینی است و در تولید ناخالص محاسبه نمی‌شود. در نتیجه، حتی رقم فرار مالیاتی مشاغل از 40 هزار میلیارد تومان نیز بیشتر بوده و عدد ذکر شده حداقلی‌ترین میزان فرار مالیاتی در تنها یکی از گروه‌های ذکر شده است.

            در این گزارش به بررسی میزان فرار مالیاتی دو گروه مهم زیرمجموعه گروه مشاغل یعنی پزشکان و وکلا می پردازیم:'
      ];
  }

}

?>
